Дипломный_проект/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ФормаДополнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дипломный_проект/src/CommonModules/ВКМ_РаботаСФормами/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьФорму(Форма) Экспорт   
	
	ИмяФормы = Форма.ИмяФормы; 
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда   
		
		ДобавитьГруппуРеквизитовАбонентскогоДоговора(Форма);
		ДобавитьПолеДатаНачалаДействия(Форма);
		ДобавитьПолеДатаОкончанияДействия(Форма); 
		ДобавитьПолеСуммаАбонентскойПлаты(Форма);
		ДобавитьПолеСтоимостьЧасаРаботы(Форма);
	
	КонецЕсли;
	
КонецПроцедуры  

Процедура ВернутьФормуВИсходноеСостояние(Форма) Экспорт  
	
	Форма.Элементы.Удалить(Форма.Элементы.ГруппаРеквизитовАбонентскогоДоговора);  
КонецПроцедуры

	
Процедура ДобавитьПолеДатаНачалаДействия(Форма)  
	
	ПолеВвода = Форма.Элементы.Добавить("ДатаНачалаДействия", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеквизитовАбонентскогоДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";
	
КонецПроцедуры       

Процедура ДобавитьПолеДатаОкончанияДействия(Форма)  
	
	ПолеВвода = Форма.Элементы.Добавить("ДатаОкончанияДействия", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеквизитовАбонентскогоДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
	
КонецПроцедуры  

Процедура ДобавитьПолеСуммаАбонентскойПлаты(Форма)  
	
	ПолеВвода = Форма.Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеквизитовАбонентскогоДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
КонецПроцедуры  

Процедура ДобавитьПолеСтоимостьЧасаРаботы(Форма)  
	
	ПолеВвода = Форма.Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеквизитовАбонентскогоДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры  





Процедура ДобавитьГруппуРеквизитовАбонентскогоДоговора(Форма)
	
	ГруппаРеквизитовАбонентскогоДоговора = Форма.Элементы.Добавить("ГруппаРеквизитовАбонентскогоДоговора", Тип("ГруппаФормы")); 
	ГруппаРеквизитовАбонентскогоДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаРеквизитовАбонентскогоДоговора.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаРеквизитовАбонентскогоДоговора.ОтображатьЗаголовок = Ложь; 
	ГруппаРеквизитовАбонентскогоДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;	
	
КонецПроцедуры

#КонецОбласти
